{
    "1867": [
        "The 1867 Canadian federal election was held from August 7 to September 20, 1867, and was the first election of Canada. It was held to elect members representing electoral districts in the provinces of Nova Scotia, New Brunswick, Ontario and Quebec to the House of Commons of the 1st Canadian Parliament.  The provinces of Manitoba (1870) and British Columbia (1871) were created during the term of the 1st Parliament of Canada and were not part of this election.",
        "Sir John A. Macdonald had been sworn in as prime minister by the Governor General, Lord Monck, when the new Canadian nation was founded on 1 July 1867. As leader of the Conservative Party of Canada (known as the Liberal-Conservative Party until 1873), he led his party in this election and continued as Prime Minister of Canada when the Conservatives won a majority of the seats in the election, including majorities of the seats (and votes) in the new provinces of Ontario and Quebec.",
        "The Liberal Party of Canada won the second most seats overall, including a majority of the seats (and votes) in the province of New Brunswick.  The Liberals did not have a party leader in the election.  George Brown, who was the leader of the Liberal Party of Ontario, was considered the \"elder statesman\" of the national party. Brown ran concurrently for seats in the Legislative Assembly of Ontario and the House of Commons of Canada, and might well have been Prime Minister in the unlikely event that the Liberals prevailed over the Conservatives in the national election. Brown failed to win a seat in either body, and the national Liberals remained officially leaderless until 1873.",
        "The Anti-Confederation Party, led by Joseph Howe, won the third most seats overall, based solely on a majority of seats (and votes) in the province of Nova Scotia. Their main desire was the reversal of the decision to join Confederation, which had become highly unpopular in that province.  The goals of the Anti-Confederation Members of Parliament (MPs) were openly supported by five of the Liberal MPs of New Brunswick.  The Anti-Confederation MPs sat with the Liberal caucus.  When the government in Britain refused to allow Nova Scotia to secede, a majority of the Anti-Confederation MPs (11 of 18) moved to the Conservatives.",
        "Halifax was a two-member riding at the time of the election, while the City of Saint John was represented by its own district and the County of Saint John. The election in Kamouraska, Quebec was delayed due to rioting."
    ],
    "1872": [
        "The 1872 Canadian federal election was held from July 20 to October 12, 1872, to elect members  of the House of Commons of Canada of the 2nd Parliament of Canada.  Prime Minister Sir John A. Macdonald's Conservative Party remained in power, defeating the Liberals. However, the Liberals increased their parliamentary representation considerably, while the Conservative seat count remained static, giving them only six more seats than the Liberals. The election produced the country's first minority government. The support of two independent Conservative MPs functionally gave Macdonald an extremely slim majority that allowed it to survive for two years, until it fell due to scandal.",
        "Edward Blake, who had a seat in both the House of Commons of Canada and the Ontario legislature, resigned as Premier of Ontario in order to run in the 1872 federal election as dual mandates had been abolished. Had the Liberals won the election, he likely would have been offered the position of Prime Minister of Canada. The party had no formal leader as such until 1873 when Alexander Mackenzie was given the title after Blake declined due to ill health. Blake was ill during much of the 1872 campaign, and it was Mackenzie who essentially led the Liberal campaign in Ontario, though not outside the province.",
        "The 1872 general election was the first to include the new provinces of Manitoba and British Columbia, which had both joined Canada after the Confederation of 1867.  By-elections had been held in both provinces to elect Members of Parliament in the newly created ridings, with Manitoba receiving four seats and British Columbia six. (In 1870 Canada had also expanded to include the current provinces of Alberta, Saskatchewan and the Territories, but no MPs were elected there until 1887.) In 1873, PEI joined Confederation and six more seats were added to the House of Commons, all filled by acclamations in by-elections."
    ],
    "1874": [
        "The 1874 Canadian federal election was held on January 22, 1874, to elect members of the House of Commons of Canada of the 3rd Parliament of Canada. Sir John A. Macdonald, who had recently been forced out of office as prime minister, and his Conservatives were defeated by the Liberal Party under their new leader Prime Minister Alexander Mackenzie.",
        "Macdonald's government had been forced to resign on November 5, 1873, because of allegations of corruption relating to the construction of the Canadian Pacific Railway (see the Pacific Scandal).  The Liberals under Mackenzie formed a government two days later with an election called for January. The Tories were unable to recover from the scandal and lost the election as a result.",
        "The election was the first general election after Prince Edward Island's entry into Confederation, and the first to use secret ballots in Canada."
    ],
    "1878": [
        "The 1878 Canadian federal election was held on September 17, 1878, to elect members of the House of Commons of the 4th Parliament of Canada. It resulted in the end of Prime Minister Alexander Mackenzie's Liberal government after only one term in office. Canada suffered an economic depression during Mackenzie's term, and his party was punished by voters for it. The Liberals' policy of free trade also hurt their support with the business establishment in Toronto and Montreal.",
        "Sir John A. Macdonald and his Conservative Party were returned to power after having been defeated four years before amidst scandals over the building of the Canadian Pacific Railway."
    ],
    "1882": [
        "The 1882 Canadian federal election was held on June 20, 1882, to elect members  of the House of Commons of Canada of the 5th Parliament of Canada.",
        "Prime Minister Sir John A. Macdonald's Conservatives and Liberal-Conservatives retained power, defeating the Liberal Party of Edward Blake."
    ],
    "1887": [
        "The 1887 Canadian federal election was held on February 22, 1887, to elect members  of the House of Commons of Canada of the 6th Parliament of Canada.",
        "The Conservative Party of Prime Minister Sir John A. Macdonald  retained power, defeating the Liberal Party of Edward Blake."
    ],
    "1891": [
        "The 1891 Canadian federal election was held on March 5, 1891, to elect members of the House of Commons of Canada of the 7th Parliament of Canada. It was won by the Conservative Party of Prime Minister Sir John A. Macdonald. ",
        "",
        "The main issue of the 1891 campaign was Macdonald's National Policy, a policy of protective tariffs. The Liberals supported reciprocity (free trade) with the United States.",
        "Macdonald led a Conservative campaign emphasizing stability, and retained the Conservatives' majority in the House of Commons. It was a close election and he campaigned hard. Macdonald died a few months after the election, which led to his succession by four different Conservative Prime Ministers until the 1896 election.",
        "It was Wilfrid Laurier's first election as leader of the Liberals. Although he lost the election, he increased the Liberals' support. He returned in 1896 to win a solid majority, despite losing the popular vote.",
        "Canadian voters would return to the issue of free trade 20 years later in the 1911 federal election."
    ],
    "1896": [
        "The 1896 Canadian federal election was held on June 23, 1896, to elect members of the House of Commons of Canada of the 8th Parliament of Canada. Though the Conservative Party, led by Prime Minister Charles Tupper, won a plurality of the popular vote, the Liberal Party, led by Wilfrid Laurier, won the majority of seats to form the next government. The election ended 18 years of Conservative rule."
    ],
    "1900": [
        "The 1900 Canadian federal election was held on November 7, 1900 to elect members of the House of Commons of Canada of the 9th Parliament of Canada. As a result of the election, the Liberal Party, led by Prime Minister Wilfrid Laurier, was re-elected to a second majority government, defeating the Conservative Party and Liberal-Conservatives led by Charles Tupper."
    ],
    "1904": [
        "The 1904 Canadian federal election was held on November 3, 1904 to elect members  of the House of Commons of Canada of the 10th Parliament of Canada.  Prime Minister Sir Wilfrid Laurier led the Liberal Party of Canada to a third term in government, with an increased majority, and over half of the popular vote.",
        "Sir Robert Borden's Conservatives and Liberal-Conservatives were unable to challenge the Liberals effectively, and lost a small portion of their popular vote, along with four seats, including his own. Borden re-entered parliament the next year in a by-election.",
        "This was the last election until 1949 in which parts of the Northwest Territories were granted representation. Most of the settled regions of the NWT entered Confederation as the provinces of Alberta and Saskatchewan on 1 September 1905, although its MP's continued to sit as representatives of the old ridings until the 10th Parliament's dissolution.",
        "One of the key issues in the election was Imperial Preference."
    ],
    "1908": [
        "The 1908 Canadian federal election was held on Monday October 26, 1908 to elect members  of the House of Commons of Canada of the 11th Parliament of Canada. Prime Minister Sir Wilfrid Laurier's Liberal Party of Canada was re-elected for a fourth consecutive term in government with a majority government. The Liberals lost four seats and a small share of the popular vote.",
        "Sir Robert Borden's Conservatives and Liberal-Conservatives won ten additional seats.",
        "This was the first election in which Alberta and Saskatchewan voted as provinces. Following their creation in 1905, the two new provinces continued to be represented by MP's initially elected under the old Northwest Territories riding boundaries, some of which straddled the new provincial border. The remainder of the Northwest Territories that previously had Parliamentary representation lost it, although parts of the NWT would gain or re-gain representation after being added to Manitoba, Ontario and Quebec in 1912. A seat would not be created for the NWT itself again (which then contained the modern NWT and Nunavut) until 1949.",
        "This is the most recent election in which a prime minister was able to lead their party to a fourth consecutive mandate."
    ],
    "1911": [
        "The 1911 Canadian federal election was held on September 21, 1911, to elect members of the House of Commons of Canada of the 12th Parliament of Canada.",
        "The central issue was Liberal support for a proposed agreement with the United States president William Howard Taft to lower tariffs. The Conservative Party denounced it because it threatened to weaken ties with Britain, submerge the Canadian economy and Canadian identity with the US, and lead to American annexation of Canada. The idea of a Canadian Navy was also an issue.",
        "The Conservatives won, and Robert Borden became the eighth prime minister. The election ended 15 years of government by the Liberal Party of Wilfrid Laurier."
    ],
    "1917": [
        "The 1917 Canadian federal election (sometimes referred to as the khaki election) was held on December 17, 1917, to elect members of the House of Commons of Canada of the 13th Parliament of Canada.  Described by historian Michael Bliss as the \"most bitter election in Canadian history\", it was fought mainly over the issue of conscription (see  Conscription Crisis of 1917). The election resulted in Prime Minister Sir Robert Borden's Unionist government elected with a strong majority and the largest percentage of the popular vote for any party in Canadian history.",
        "The previous election had been held in 1911 and was won by Borden's Conservatives. Normally, there is a constitutional requirement that Parliament last no longer than five years, which would have resulted in an election in 1916.  However, citing  the emergency of the Great War, the Parliament of Canada approved a one-year extension, which was implemented by the British Parliament.  The Borden government hoped that the delay would allow the formation of a \"grand coalition\" government, encompassing all the parties, such as existed in Britain.",
        "Sir Wilfrid Laurier, head of the Liberal Party of Canada, refused to join the coalition over the issue of conscription, which was strongly opposed in the Liberal heartland of Quebec. Laurier worried that agreeing to Borden's coalition offer would cause that province to abandon the Liberals and perhaps even Canada. Borden proceeded to form a \"Unionist\" government, and the Liberal Party split over the issue. Many English Canadian Liberal MPs and provincial Liberal parties in English Canada supported the new Unionist government.",
        "To ensure victory for conscription, Borden introduced two laws to skew the voting towards the government. The first, the Wartime Elections Act, disenfranchised conscientious objectors and Canadian citizens if they were born in enemy countries and had arrived after 1902. The law also gave female relatives of servicemen the vote.  Thus, the 1917 election was the first federal election in which some women were allowed to vote. The other new law was the Military Voters Act, which allowed soldiers serving abroad to choose which riding their vote would be counted in or to allow the party for which they voted to select the riding in which the vote would be counted. That allowed government officials to guide the strongly pro-conscription soldiers into voting in those ridings where they would be more useful. Servicemen were given a ballot with the simple choice of \"Government\" or \"Opposition\". It is calculated that the Unionist government took 14 seats from the Opposition due to its use of Army votes.",
        "Soon after these measures were passed, Borden convinced a faction of Liberals (using the name Liberal-Unionists) along with Gideon Decker Robertson, who was described as a \"Labour\" Senator (but was unaffiliated with any Labour Party) to join with them, forming the Unionist government in October 1917. He then dissolved parliament to seek a mandate in the election, which pitted \"Government\" candidates, running as the Unionist Party, against the anti-conscription faction of the Liberal Party, which ran under the name Laurier Liberals. As well, Independent, Labour and Socialist candidates ran in many ridings across the country.",
        "The divisive debate ended with the country divided on linguistic lines. The Liberals won 82 seats, 62 in Quebec, with many other seats won in provinces such as Manitoba, New Brunswick, and Ontario in ridings with significant French Canadian populations. The Unionists won 153 seats. The three Unionist won seats in Quebec were all in mainly English-speaking ridings. That led to the Francœur Motion in January 1918.",
        "Out of 235 seats, 33 were won by acclamation—17 to the Laurier Liberals (all in Quebec) and 16 to the Unionists (all outside Quebec).  Two of the Unionist acclamations were for the riding of Halifax, where the only candidates were two Unionists, and where, eleven days earlier, the tragic Halifax Explosion had taken place.",
        "The election was conducted mostly using First past the post in single-member ridings but Ottawa, Queens, and Halifax each had two members and each of the voters there cast up to two votes as per Plurality block voting."
    ],
    "1921": [
        "The 1921 Canadian federal election was held on December 6, 1921, to elect members  of the House of Commons of Canada of the 14th Parliament of Canada. The Union government that had governed Canada through the First World War was defeated, and replaced by a Liberal government under the young leader William Lyon Mackenzie King. A new third party, the Progressive Party, won the second most seats in the election.",
        "Since the 1911 election, the country had been governed by the Conservatives, first under the leadership of Prime Minister Robert Borden and then under Prime Minister Arthur Meighen.  During the war, the Conservatives had united with the pro-conscription Liberal-Unionists and formed a Union government. A number of Members of Parliament (MPs), mostly Quebecers, stayed loyal to Sir Wilfrid Laurier, however, and they maintained their independence. When Laurier died, he was replaced as leader by the Ontarian Mackenzie King. After the 1919 federal budget, a number of western unionist MPs, who were former Liberals, left the Union government in protest against high tariffs on farm products imposed by the budget. Led by Thomas Alexander Crerar, the group became known as the Progressive Party. Also running were a number of Labour advocates, foremost amongst them J. S. Woodsworth of Winnipeg, who had organized their political movement after the Winnipeg general strike of 1919. Meighen had played a key role in violently suppressing the strikers and this earned him the animosity of organized labour.",
        "Meighen attempted to make the \"Unionist\" party a permanent alliance of Tories and Liberals by renaming it the National Liberal and Conservative Party, but the name change failed, and most Unionist Liberals either returned to the Liberal fold or joined the new Progressive Party. Besides the labour strife and farm tariffs in the Prairie provinces, the Conscription Crisis of 1917 had a lasting effect on Tory fortunes by making the party virtually unelectable in Quebec.",
        "The election was the first in which the majority of Canadian women were allowed to vote, thanks to reforms passed by the Conservatives. Five women also ran for office. Agnes Macphail of the Progressive Party was elected as the first woman MP in Canada.",
        "Parliament was split three ways by this election. King's Liberals took 41 percent of the vote and won a majority government of just one seat. It won all of Quebec, much of the Maritime Provinces, and a good portion of Ontario.",
        "The Progressive Party, including the United Farmers of Alberta (UFA), won the second largest number of seats, dominating the Prairies, and winning almost a third of the seats in Ontario. Liberal and Conservative candidates were shut out in Alberta, with 10 UFA and two Labour candidates taking the province's 12 federal seats. The party won only one seat east of Ontario, however. Despite winning the second most seats, it declined to form the official opposition. It would be the only Canadian federal election before 1993 in which a party other than the Liberals or the Conservatives/Progressive Conservatives won the second most seats.",
        "The Unionists/Conservatives lost the most seats up to that time of any governing party at the federal level. They won fewer seats than the Progressives (despite having more popular votes) but were named as the official opposition anyway. The Conservatives won much of the Ontario seats and had some support in the Maritimes and British Columbia but won no seats in the Prairies or in Quebec.",
        "Three Labour MPs were elected: Independent Labour candidate J. S. Woodsworth won a Winnipeg seat largely due to his role in the 1919 Winnipeg general strike, and Labour Party candidates William Irvine and Joseph Tweed Shaw were elected in Calgary."
    ],
    "1925": [
        "The 1925 Canadian federal election was held on October 29, 1925 to elect members  of the House of Commons of Canada of the 15th Parliament of Canada. The Conservative party took the most seats in the House of Commons, although not a majority. Prime Minister William Lyon Mackenzie King's Liberal Party was invited to form a minority government. Unlike the Conservative party, King's Liberals had the conditional support of the many Farmer/Progressive MPs.",
        "The government fell the following year. Governor General Baron Byng of Vimy offered the Conservatives under Meighen a chance to form government. This too fell in short order. Byng's action in refusing King's request became the main issue of the 1926 election under the name \"King–Byng Affair\"."
    ],
    "1926": [
        "The 1926 Canadian federal election was held on September 14, 1926, to elect members of the House of Commons of Canada of the 16th Parliament of Canada. The election was called after an event known as the King–Byng affair.",
        "In the 1925 federal election, Prime Minister William Lyon Mackenzie King's Liberal Party of Canada had won fewer seats in the House of Commons of Canada than the Conservatives of Arthur Meighen. King, however, was determined to continue to govern with the support of the Progressive Party. The combined Liberal and Progressive caucuses gave Mackenzie King a plurality of seats in the House of Commons, and the ability to form a minority government.",
        "The agreement collapsed, however, after a scandal, and King approached the governor general of Canada, Baron Byng of Vimy, to seek dissolution of the Parliament. Byng refused on the basis that the Conservatives had won the most seats in the prior election and so he called upon Meighen to form a government.",
        "Prime Minister Meighen's government was soon defeated in a vote of non-confidence, and Byng agreed to Meighen's request to dissolve Parliament and call new elections. King effectively campaigned against Byng, instead of against Meighen, in the election and won the most seats in the House of Commons although his party received fewer votes than the Conservatives. However, this may have been largely because the Liberals did not run candidates in all ridings - they had an informal electoral pact with the Progressives and Liberal-Progressives. ",
        "As well, Conservatives suffered from disproportional transition from votes to seats. In particular, in Manitoba Meighen's party captured almost 40 percent of the vote, twice the vote share of any other party, but no seats.",
        "King's Liberals did not take a marjoty of seats but were able to govern with the support of Liberal-Progressive Members of Parliament.",
        "The Progressive Party's Albertan legislators left the party and instead sought re-election under the United Farmers of Alberta banner. At the time, the UFA formed the government in Alberta. They won eleven seats in Alberta, an increase of nine from the previous year and the same number the Progressives won elsewhere. The Progressives' seat count was halved compared to 1925, although when viewed in its totality the election result can also be regarded as a combined net decrease of two seats for the Progressives and UFA.",
        "Byng returned to Britain at the end of the year and was raised to the rank of viscount as an expression of confidence in him. After his party's defeat and the loss of his seat, Meighen resigned as Conservative leader."
    ],
    "1930": [
        "The 1930 Canadian federal election was held on July 28, 1930, to elect members  of the House of Commons of the 17th Parliament of Canada. Richard Bedford Bennett's Conservative Party won a majority government, defeating the Liberal Party led by Prime Minister William Lyon Mackenzie King.",
        "3,922,481 votes were cast in this election."
    ],
    "1935": [
        "The 1935 Canadian federal election was held on October 14, 1935, to elect members of the House of Commons of Canada of the 18th Parliament of Canada. The Liberal Party of William Lyon Mackenzie King won a majority government, defeating Prime Minister R. B. Bennett's Conservatives.",
        "The central issue was the economy, which was still in the depths of the Great Depression. In office since the 1930 election, Bennett had sought to stimulate the economy during his first few years through a policy of high tariffs and trade within the British Empire. In the last months of his time in office, he reversed his position, copying the popular New Deal of Franklin Roosevelt in the United States. Upset about high unemployment and inaction by the federal government, voters were unwilling to allow the Conservatives to continue to govern, despite their change of policy.",
        "The Conservatives were also suffering severe internal divisions. During his first years in office, Bennett had alienated those in his party who supported intervention in the economy. His last minute conversion to interventionism alienated the rest of the party. Former cabinet minister H.H. Stevens left to form the Reconstruction Party. Senior minister Sir Joseph Flavelle announced he would be supporting the Liberals.",
        "Voters opted for Mackenzie King's promise of mild reforms to restore economic health. The Liberals crushed the Tories, winning 173 seats to the Conservatives' 39, the worst ever performance by the Tories until their collapse in 1993. The Liberal Party would continue to hold power until 1957.",
        "The 1935 election was also important in it saw the final demise of the Progressive Party and the United Farmers of Alberta. The Progressive Party, having been in gradual decline over the previous decade, did not run any candidates under its own banner. The federal party, always highly decentralized, ceased to exist sometime circa 1940. However, Liberal-Progressive Premier of Manitoba John Bracken brought the name back into formal use when he moved to federal politics in 1942; his first act as leader of the Conservatives was to rechristen them the Progressive Conservative Party.",
        "The United Farmers of Alberta, whose credibility was ruined by a sex scandal involving former leader John E. Brownlee, lost all their seats in the provincial election earlier that year, and subsequently withdrew from electoral politics, likewise fielding no candidates in this federal election.",
        "Two new movements rose out of the west, however. The new Co-operative Commonwealth Federation, a social democratic party, first competed in this election and won seven seats, promising social reform. The Social Credit Party of Canada was even more successful, capturing seventeen seats on its platform of monetary reform despite winning less of the popular vote than the former. Fifteen of these seats were in Alberta, where the party dominated after having swept to power in a landslide less than two months before the federal vote. John Horne Blackmore was chosen to lead the Social Credit caucus after the election. The de facto leader of the national movement was Alberta Premier William Aberhart, who did not stand in the federal election himself."
    ],
    "1940": [
        "The 1940 Canadian federal election was held March 26, 1940, to elect members  of the House of Commons of Canada of the 19th Parliament of Canada.  Prime Minister William Lyon Mackenzie King's Liberal Party was re-elected to their second consecutive majority government.",
        "The election was overshadowed by the Second World War, which caused many Canadians to rally around the government. In response to this, the Conservative Party of Robert Manion ran on a platform advocating the creation of an all-party national unity government and ran under the name \"National Government\" in this election. Though Manion was personally opposed to conscription, the Liberals faced intense pressure in Quebec on the question and promised not to institute the measure. This promise was to haunt the Liberals as they faced increasing pressure from the military and especially from English Canada to bring in the measure. To release him from his September 1939 promise, King called a plebiscite in 1942 on the question. See also Conscription Crisis of 1944. It was the most successful election for the Liberal Party in its history, in which it captured 73% of the seats in the House of Commons. By contrast, the Conservatives performed even worse than in the previous election, finishing with the same number of seats, a slightly lower share of the popular vote, and with Manion being defeated in his riding. This was the last election contested by the original incarnation of the Conservatives, who thereafter merged with remnants of the moribund Progressive Party to form the Progressive Conservatives.",
        "Social Credit ran jointly with the New Democracy movement of William Duncan Herridge.",
        "Some candidates of the Conservative and Social Credit parties insisted on running under the traditional names, however.",
        "The Co-operative Commonwealth Federation (CCF) gained its first seat east of Manitoba, with the election of Clarence Gillis from Cape Breton Island. This election was the last one for its ailing leader, J. S. Woodsworth."
    ],
    "1945": [
        "The 1945 Canadian federal election was held on June 11, 1945, to elect members of the House of Commons of the 20th Parliament of Canada. Prime Minister William Lyon Mackenzie King's Liberals won a third term. The party fell five seats short of a majority but was able to rule as a majority government with the support of Independent Liberal MPs.",
        "Since 1939, Canada had been fighting in World War II. In May 1945, the war in Europe ended, allowing King to call an election. As the war in Asia was still raging on, King promised a voluntary force to fight in Operation Downfall, the planned invasion of Japan, while Progressive Conservative Party (PC Party) leader John Bracken promised conscription, which was an unpopular proposal and led to the PCs' third consecutive defeat. The Liberals were also re-elected because of their promise to expand welfare programs. However, they also lost about a third of their seats; this stark decline in support was partly attributed to their introduction of conscription in 1944 (which was unpopular in Quebec, paving the rise of the Bloc Populaire) as well as the breakthrough of the democratic socialist Co-operative Commonwealth Federation (CCF), which campaigned on an even bigger expansion of the welfare state than the Liberals. The Social Credit Party made modest gains.",
        "Although the election officially resulted in a minority government, the election of eight \"Independent Liberal\" MPs, most of whom did not run as official Liberals because of their opposition to conscription, gave the King government an effective working majority in parliament. Most of the Independent Liberal MPs joined (or re-joined) the Liberal caucus following World War II when the conscription issue became moot. As King was defeated in his own riding of Prince Albert, fellow Liberal William MacDiarmid, who was re-elected in the safe seat of Glengarry, resigned so that a by-election could be held, which was subsequently won by King."
    ],
    "1949": [
        "The 1949 Canadian federal election was held June 27, 1949, to elect members of the House of Commons of Canada of the 21st Parliament of Canada.",
        "The Liberal Party of Canada was re-elected with its fourth consecutive government, winning 191 seats (73 percent of the seats in the House of Commons), with just under 50 percent of the popular vote.",
        "It was the Liberals' first election in almost thirty years not under the leadership of William Lyon Mackenzie King. King had retired in 1948, and was replaced as Liberal leader and Prime Minister by Louis St. Laurent.",
        "It was the first federal election with Newfoundland voting, having joined Canada in March of that year. It was also the first election since 1904 in which part of the remaining parts of the Northwest Territories were granted representation, following the partitioning off of the provinces of Alberta and Saskatchewan.",
        "The Liberal Party victory won the largest majority in Canadian history to that point. As of 2022, it remains the third largest majority government in Canadian history, and the largest in the party's history (the Progressive Conservative Party won larger seat majorities in 1958 and 1984).",
        "The Progressive Conservative Party, led by former Premier of Ontario George Drew, gained little ground in this election. The party lost over a third of their seats.",
        "Smaller parties, such as the social democratic Co-operative Commonwealth Federation, and Social Credit, a party that advocated monetary reform, lost support to the Liberals and, to a lesser extent, the Conservatives."
    ],
    "1953": [
        "The 1953 Canadian federal election was held on August 10, 1953, to elect members  of the House of Commons of Canada of the 22nd Parliament of Canada. Prime Minister Louis St. Laurent led his Liberal Party of Canada to its second consecutive majority government, although the party lost seats to the other parties.",
        "The Progressive Conservative Party, led by former Premier of Ontario, George Drew, formed the official opposition, but for the last time until 1993, the party was unable to win the popular vote in any of Canada's provinces or territories.",
        "This was the last election until 1988 in which any party won back-to-back majorities, and the last until 1997 in which the Liberals would accomplish this feat. This election is the last time that the Liberals would win more seats in Alberta than the largest right-of-centre party in Canada, and the last time they would win more seats than the Tories in Alberta until 1993."
    ],
    "1957": [
        "The 1957 Canadian federal election was held June 10, 1957, to select the 265 members of the House of Commons of Canada of the 23rd Parliament of Canada. In one of the greatest upsets in Canadian political history, the Progressive Conservative Party (also known as \"PCs\" or \"Tories\"), led by John Diefenbaker, brought an end to 22 years of Liberal rule, as the Tories were able to form a minority government despite losing the popular vote to the Liberals.",
        "The Liberal Party had governed Canada since 1935, winning five consecutive elections. Under Prime Ministers William Lyon Mackenzie King and Louis St. Laurent, the government gradually built a welfare state. During the Liberals' fifth term in office, the opposition parties depicted them as arrogant and unresponsive to Canadians' needs. Controversial events, such as the 1956 \"Pipeline Debate\" over the construction of the Trans-Canada Pipeline, had hurt the government. St. Laurent, nicknamed \"Uncle Louis\", remained popular, but exercised little supervision over his cabinet ministers.",
        "In 1956, Tory leader George A. Drew unexpectedly resigned due to ill health. In his place, the PC party elected the fiery and charismatic Diefenbaker. The Tories ran a campaign centred on their new leader, who attracted large crowds to rallies and made a strong impression on television. The Liberals ran a lacklustre campaign, and St. Laurent made few television appearances. Uncomfortable with the medium, the Prime Minister read his speeches from a script and refused to wear makeup.",
        "Abandoning their usual strategy of trying to make major inroads in Liberal-dominated Quebec, the Tories focused on winning seats in the other provinces. They were successful; though they gained few seats in Quebec, they won 112 seats overall to the Liberals' 105. With the remaining seats won by other parties, the PC party only had a plurality in the House of Commons, but the margin was sufficient to make John Diefenbaker Canada's first Tory Prime Minister since R. B. Bennett in 1935."
    ],
    "1958": [
        "The 1958 Canadian federal election was held to elect members  of the House of Commons of Canada of the 24th Parliament of Canada on March 31, 1958, just nine months after the 23rd election. It transformed Prime Minister John Diefenbaker's minority into the largest majority government in Canadian history and the second-largest percentage of the popular vote. Although the Tories would surpass their 1958 seat total in the 1984 election, the 1958 result (achieved in a smaller House) remains unmatched both in terms of percentage of seats (78.5%) and the size of the government majority over all opposition parties (a 151-seat majority). Voter turnout was 79.4%."
    ],
    "1962": [
        "The 1962 Canadian federal election was held on June 18, 1962, to elect members of the House of Commons of Canada of the 25th Parliament of Canada. The governing Progressive Conservative (PC) Party won a plurality of seats in this election, and its majority government was reduced to a minority government.",
        "When the election was called, PC Prime Minister John Diefenbaker had governed for four years with the largest majority until then in the House of Commons in Canadian history.",
        "This election reduced the PCs to a tenuous minority government as a result of economic difficulties such as high unemployment and a slumping Canadian dollar, as well as unpopular decisions such as the cancellation of the Avro Arrow. Despite the Diefenbaker government's difficulties, the Liberal Party, led by Lester B. Pearson, was unable to make up enough ground in the election to defeat the government. For Social Credit, routed from the Commons just four years earlier, this election proved to be their most successful ever since they would never better the 30 seats won; for example, they lost seats in 1963 despite gaining a slightly better share of the vote.",
        "This was the first election in which all adult Indigenous Canadians had the right to vote after the passage on March 31, 1960 of a repeal of certain sections of the Canada Elections Act.",
        "For the first time ever, the entire landmass of Canada was covered by federal electoral districts (the former Mackenzie River riding was expanded to cover the entire Northwest Territories).",
        "This was also the first general election contested by the New Democratic Party."
    ],
    "1963": [
        "The 1963 Canadian federal election was held on April 8, 1963 to elect members of the House of Commons of Canada of the 26th Parliament of Canada. It resulted in the defeat of the minority Progressive Conservative (Tory) government of Prime Minister John Diefenbaker, with the Liberals returning to power for the first time in 6 years, where they would remain for twenty of the next twenty-one years (winning every election except the 1979 election until their landslide defeat in 1984).  For the Social Credit Party, despite getting their highest ever share of the vote, the party lost 6 seats compared to its high-water mark in 1962."
    ],
    "1965": [
        "The 1965 Canadian federal election was held on November 8, 1965 to elect members of the House of Commons of Canada of the 27th Parliament of Canada. The Liberal Party of Prime Minister Lester B. Pearson was re-elected with a larger number of seats in the House. Although the Liberals lost a small share of the popular vote, they were able to win more seats, falling just short of a majority."
    ],
    "1968": [
        "The 1968 Canadian federal election was held on June 25, 1968, to elect members of the House of Commons of Canada of the 28th Parliament of Canada.",
        "In April 1968, Prime Minister Lester Pearson of the Liberal Party resigned as party leader as a result of declining health and failing to win a majority government in two attempts. He was succeeded by his Minister of Justice and Attorney General Pierre Trudeau, who called an election immediately after becoming prime minister. Trudeau's charisma appealed to Canadian voters; his popularity became known as \"Trudeaumania\" and helped him win a comfortable majority. Robert Stanfield's Progressive Conservatives lost seats whereas the New Democratic Party's support stayed the same."
    ],
    "1972": [
        "The 1972 Canadian federal election was held on October 30, 1972, to elect members  of the House of Commons of Canada of the 29th Parliament of Canada. It resulted in a slim victory for the governing Liberal Party led by Prime Minister Pierre Trudeau, which won 109 seats, compared to 107 seats for the opposition Progressive Conservatives led by Robert Stanfield. Trudeau's Liberals experienced a decline in support as a result of rising unemployment.",
        "A further 48 seats were won by other parties and independents. On election night, the results appeared to give 109 seats to the Tories, but once the counting had finished the next day, the final results gave the Liberals a minority government and left the New Democratic Party led by David Lewis holding the balance of power.",
        "This was the first national election held in Canada after the voting age was lowered from 21 to 18 in 1970."
    ],
    "1974": [
        "The 1974 Canadian federal election was held on July 8, 1974, to elect members  of the House of Commons of Canada of the 30th Parliament of Canada.  The governing Liberal Party was reelected, going from a minority to a majority government, and gave Prime Minister Pierre Trudeau his third term. The Progressive Conservatives, led by Robert Stanfield, did well in the Atlantic provinces, and in the West, but Liberal support in Ontario and Quebec ensured a majority Liberal government."
    ],
    "1979": [
        "The 1979 Canadian federal election was held on May 22, 1979, to elect members of the House of Commons of Canada of the 31st Parliament of Canada. It resulted in the defeat of the Liberal Party of Canada after 16 years in power, 11 of them under Prime Minister Pierre Trudeau. Joe Clark led the Progressive Conservative Party to power but with only a minority of seats in the House of Commons. The Liberals, however, beat the Progressive Conservatives in the overall popular vote by more than 400,000 votes (40.11% to 35.89%). Taking office on the eve of his 40th birthday, Clark became the youngest prime minister in Canadian history."
    ],
    "1980": [
        "The 1980 Canadian federal election was held on February 18, 1980, to elect members of the House of Commons of Canada of the 32nd Parliament of Canada. It was called when the minority Progressive Conservative government led by Prime Minister Joe Clark was defeated in the Commons.",
        "Clark and his government had been under attack for its perceived inexperience, for example in its handling of its 1979 election campaign commitment to move Canada's embassy in Israel from Tel Aviv to the hotly disputed territory of Jerusalem.",
        "Clark had maintained uneasy relations with the conservative-populist Quebec-based Social Credit Party (nicknamed the Socreds), who were the fourth largest party in the House of Commons. While he needed support from the party's six MPs to get legislation passed, he was unwilling to agree to the conditions they imposed for their support. Clark recruited one Social Credit MP, Richard Janelle, to join the PC caucus.",
        "In December 1979, just six months after the 1979 election, Clark's government could not collect enough votes in the House of Commons to survive. Clark's Minister of Finance, John Crosbie, introduced an austere government budget that proposed to increase the excise tax on gasoline by 18¢ per Imperial gallon (about 4¢ a litre) to reduce the federal government's deficit. The New Democratic Party's finance critic, Bob Rae, proposed a subamendment to the budget motion, stating that the House of Commons did not approve of the budget. The NDP's 32 MPs were set against the budget. The five remaining Social Credit MPs abstained, upset that the revenues from the increased gas tax were not allocated to Quebec.",
        "In addition, one Tory MP (Alvin Hamilton) was too ill to attend the vote while two others (Flora MacDonald and Lloyd Crouse) were abroad. Meanwhile, the Liberals assembled all but one member of their caucus (Serge Joyal), even going as far as to take two MPs (Maurice Dionne and Claude Lajoie) out of the hospital for the vote. Rae's subamendment was adopted by a vote of 139–133, bringing down the government and forcing an election.",
        "Former Liberal Prime Minister Pierre Trudeau, who had served since 1968, had announced his resignation as leader of the Liberal Party following its defeat in 1979. However, no leadership convention had been held when Clark's Progressive Conservative government fell. Trudeau quickly rescinded his resignation and led the party to victory, winning 33 more seats than in 1979. That enabled the Liberals to form a majority government.",
        "Clark's Tories campaigned under the slogan, \"Real change deserves a fair chance,\" but less than a third of voters voted to give Clark another chance. The loss of the budget vote just seven months into his mandate and his subsequent defeat in the February 18 general election resulted in his ouster as leader by Brian Mulroney in 1983.",
        "The Socreds' abstention on the crucial budget vote, even if not decisive (the vote would still have passed by 139–138 had they opposed it), contributed to a perception that the party had become irrelevant since the death of iconic leader Réal Caouette in 1976. In 1980 it ran 20 fewer candidates than it had run in 1979 and lost more than three-fifths of its vote share. It won no seats—Liberal challengers defeated all of the incumbent SC MPs—although four of its incumbent MPs did post respectable second-place finishes. Having lost its presence in the House of Commons for the first time since the 1958 Canadian federal election, Social Credit rapidly declined into obscurity. It was never a serious contender to win seats again, although the party nominally continued to exist until 1993.",
        "The new House was very regionally polarized. The Liberals were shut out of seats west of Manitoba, although receiving more than 20 percent of the vote in each western province. The Liberal party piled up massive seat counts in the two most populous provinces to achieve their victory. Liberal candidates collected more than two thirds of the votes cast in Quebec, and the party took half its seats in just that one province. The Tories won only one seat out of 75 in Quebec, though they took 12 percent of the vote there. The Tories won 43 percent of the seats in the four Atlantic provinces, which helped them elect more than a hundred MPs overall. All but 14 of them were elected in ridings west of Quebec."
    ],
    "1984": [
        "The 1984 Canadian federal election was held on September 4, 1984, to elect members to the House of Commons of the 33rd Parliament of Canada.",
        "In the largest landslide victory in Canadian political history, the Progressive Conservative Party (PC Party), led by Brian Mulroney, defeated the incumbent governing Liberal Party led by Prime Minister John Turner. This was the first election since 1958 in which the PC Party won a majority government and is also the only time since 1958 that Canada's governing party received an actual majority of votes cast.",
        "Mulroney's victory came as a result of his building of a 'grand coalition' that comprised social conservatives from the West, Red Tories from the East, Quebec nationalists, and fiscal conservatives. Mulroney's PCs won the largest number of seats in Canadian history at 211. Winning 74.8 percent of the seats in the House of Commons, meant they won the second-largest percentage of seats in Canadian history. Only Progressive Conservative Prime Minister John Diefenbaker's triumph in the 1958 federal election, at 78.5 percent, was higher. This was the last time that the winning party won every province and territory and the last time that the winning party received over 50 percent of the national popular vote.  The Liberals suffered what at that time was the worst defeat for a governing party at the federal level (in terms of percentage of seats). The New Democratic Party (NDP) saw no significant change to their seat count.",
        "The election marked the end of the Liberals' long dominance of federal politics in Quebec, a province which had been the bedrock of Liberal support for almost a century. They would not win a majority of Quebec seats again until three decades later in 2015."
    ],
    "1988": [
        "The 1988 Canadian federal election was held on November 21, 1988, to elect members to the House of Commons of Canada of the 34th Parliament of Canada.  It was an election largely fought on a single issue: the Canada–United States Free Trade Agreement (CUSFTA); the Progressive Conservative Party campaigned in favour of it, whereas the Liberal Party and the New Democratic Party (NDP) campaigned against it.",
        "The incumbent prime minister, Brian Mulroney, led his Progressive Conservative Party to a second majority government. Mulroney was the party's first leader since John A. Macdonald to win a second majority government.",
        "The Liberal Party experienced a recovery after its 1984 wipeout, more than doubling its seat count. The New Democratic Party won its largest number of seats up to the time (they would beat the 1988 record in 2011).",
        "The election was the last won by the Progressive Conservatives, the last until 2011 in which a right-of-centre party formed a majority government, and the last where a right-of-centre party won the most seats in Quebec. It was also the last election in Canadian history in which only three parties would be elected to Parliament. With Mulroney winning a majority, the agreement was passed into law, even though a majority of the voters had voted for parties opposing free trade."
    ],
    "1993": [
        "The 1993 Canadian federal election was held on October 25, 1993, to elect members to the House of Commons of the 35th Parliament of Canada. Considered to be a major political realignment, it was one of the most eventful elections in Canada's history. Two new regionalist parties emerged, finishing second and third in seat count. Most notably, the election marked the worst defeat for a governing party at the federal level and among the worst ever suffered by a governing party in the Western democratic world. In a landslide, the Liberal Party, led by Jean Chrétien, won a majority government.",
        "The election was called on September 8, 1993, by the new Progressive Conservative Party (PC) leader, Prime Minister Kim Campbell, near the end of her party's five year mandate. When she succeeded longtime Prime Minister Brian Mulroney and assumed office in June, the party was deeply unpopular due to the failure of the Meech Lake and Charlottetown Accords, the introduction of the Goods and Services Tax, and the early 1990s recession. The PCs were further weakened by the emergence of new parties that were competing for its core supporters. Campbell's initial efforts helped the party recover somewhat in pre-election polls before the writs were issued. However, this momentum did not last, and the Progressive Conservatives suffered the most lopsided defeat for a Canadian governing party at the federal level, which was also the worst ever suffered by a governing party in the Western democratic world, losing all but 2 of their 156 seats and more than half of their vote from 1988. The Progressive Conservatives also launched a controversial attack ad during the campaign.",
        "The Western-based Reform Party won over many traditional PC voters, particularly social conservatives, alienated Western Canadians, and fiscal conservatives who opposed the Mulroney government's deficit spending and tax increases. The popularity of Preston Manning, and profound Western discontent with the PCs, led the Reform Party to replace the PCs as the major right-wing party in the Commons, although it won only one seat east of Manitoba. Though the Progressive Conservatives recovered slightly in the 1997 election, they lost seats in 2000 and would never be a major force in Canadian politics again. In 2003, the Progressive Conservative Party disappeared entirely when it merged with the larger Canadian Alliance (successor of the Reform Party) to create the new Conservative Party of Canada.",
        "The sovereigntist Bloc Québécois won almost half of the popular vote in Quebec and became the Official Opposition. To date, this is the only time that a party committed to the political secession of a region of Canada has become the Official Opposition of Canada. The traditional third party, the New Democratic Party (NDP), collapsed to nine seats only one election after having what was then its best performance. It remains the NDP's worst result in a federal election since its formation and the only election where the party polled fewer than one million votes.",
        "The turnover of MPs was stark and unprecedented for Canadian politics, with 132 MPs losing their seats. In total, 194 out of 295 ridings changed hands."
    ],
    "1997": [
        "The 1997 Canadian federal election was held on June 2, 1997, to elect members to the House of Commons of the 36th Parliament of Canada. Prime Minister Jean Chrétien's Liberal Party won a second majority government. The Reform Party replaced the Bloc Québécois as the Official Opposition.",
        "The election results closely followed the pattern of the 1993 election. The Liberals swept Ontario, while the Bloc won a majority in Quebec. Reform made sufficient gains in the West to allow Preston Manning to become leader of the Official Opposition, but lost its only seat east of Manitoba. The most significant change was major gains in Atlantic Canada by the New Democratic Party (NDP) and the rump Progressive Conservative Party.  The Liberal victory was not in doubt, though some commentators on election night were predicting that the party would be cut down to a minority government and that Chrétien might lose his seat. Chrétien narrowly won his riding, and the Liberals maintained a nine-seat majority thanks to gains in Quebec at the expense of the Bloc.  Jean Charest's Tories and Alexa McDonough's NDP both regained official party status in the House of Commons.",
        "This was the first time that five political parties held official party status in a single session of Canada's Parliament, and the only time to date that five different parties have won the popular vote in at least one of the provinces and territories of Canada."
    ],
    "2000": [
        "The 2000 Canadian federal election was held on November 27, 2000, to elect members to the House of Commons of Canada of the 37th Parliament of Canada. Prime Minister Jean Chrétien's Liberal Party won a third majority government.",
        "Since the previous election of 1997, small-c conservatives had begun attempts to merge the Reform Party of Canada and the Progressive Conservative Party of Canada as part of the United Alternative agenda. During that time, Jean Charest stepped down as leader of the Progressive Conservatives and former Prime Minister Joe Clark took over the party and opposed any union with the Reform Party. In the spring of 2000, the Reform Party became the Canadian Alliance, a political party dedicated to uniting  conservatives together into one party. Former Reform Party leader Preston Manning lost in a leadership race to Stockwell Day who became leader of the new Canadian Alliance party.",
        "The federal government called an early election after being in office for close to three and a half years (with a maximum allowed mandate of five years). The governing Liberal Party of Canada won a third consecutive majority government, winning more seats than in 1997. The Canadian Alliance only made minor gains, and an Eastern breakthrough did not happen. The Bloc Québécois, New Democratic Party and the Progressive Conservatives all suffered slight losses.",
        "This was the last election as of 2024 in which an incumbent government successfully defended its parliamentary majority. It was also the last election in which a single party won more than 40% of the popular vote, although the Conservative Party under Stephen Harper in 2011 (39.62%) and the Liberal Party under Justin Trudeau in 2015 (39.47%) would both come close. This was the only election contested by the Canadian Alliance and the last by the Progressive Conservatives (as they both merged into the Conservative Party of Canada in 2003). This was also the first election in which Nunavut was its own separate territory (before, it was part of the Northwest Territories)."
    ],
    "2004": [
        "The 2004 Canadian federal election was held on June 28, 2004, to elect members to the House of Commons of Canada of the 38th Parliament of Canada. The Liberal government of Prime Minister Paul Martin lost its majority but was able to continue in office as a minority government after the election. This was the first election contested by the newly amalgamated Conservative Party of Canada, after it was formed by the two right-of-centre parties, the Progressive Conservative Party and the Canadian Alliance.",
        "On May 23, 2004, the governor general, Adrienne Clarkson, on the advice of Martin, ordered the dissolution of the House of Commons, triggering an early election despite the Liberals being only three and a half years into their five-year mandate. Earlier, the election result was widely expected to be a fourth consecutive majority government for the Liberals, but early in 2004 Liberal popularity fell sharply due to the emerging details of the sponsorship scandal. Polls even started to indicate the possibility of a Conservative minority government. In the end, the Liberals won a minority government, though they were well short of a majority and lost nearly three dozen seats.",
        "On election day, polling times were arranged to allow results from most provinces to be announced more or less simultaneously, with the exception of Atlantic Canada, whose results were known before the close of polling in other provinces due to the British Columbia Supreme Court's decision in R v Bryan."
    ],
    "2006": [
        "The 2006 Canadian federal election was held on January 23, 2006, to elect members to the House of Commons of Canada of the 39th Parliament of Canada.",
        "New details of the sponsorship scandal were released through the Gomery Commission, and the three opposition parties aimed to bring down Liberal Prime Minister Paul Martin's minority government, contending that it was corrupt. On November 28, 2005, Martin's government was defeated on a motion of non-confidence. A day later, Martin met with Governor General Michaëlle Jean to dissolve parliament, triggering an unusual winter election.",
        "The Conservative Party, that was formed in 2003 from the merger of the Progressive Conservative Party and the Canadian Alliance, scored its first-ever victory as they won the greatest number of seats in the House of Commons, winning 124 out of 308, up from 99 seats in 2004. Due to the emerging details of the sponsorship scandal, as well as a unified right-of-centre party, the Tories led by Stephen Harper went on to end over 12 years of Liberal rule. Harper formed the smallest minority government in Canadian history (in terms of proportion of seats), becoming prime minister. The New Democratic Party experienced a modest boost in support whereas the Bloc Québécois' seat count nearly stayed the same. This is the most recent election in which the winning federal party did not win New Brunswick and Ontario."
    ],
    "2008": [
        "The 2008 Canadian federal election  was held on October 14, 2008, to elect members to the House of Commons of Canada of the 40th Canadian Parliament after the previous parliament had been dissolved by Governor General Michaëlle Jean on September 7, 2008.",
        "Conservative Prime Minister Stephen Harper called the election due to his belief that there was a lack of cooperation between the minority government Conservatives and the opposition parties, which the former had to rely on to pass legislation; hence Harper argued that Parliament had reached the end of its productiveness.",
        "The election resulted in a second but stronger minority government for Harper's Conservatives. While they were a dozen seats away from a majority government, the Liberal Party led by Stéphane Dion lost 18 seats as the New Democratic Party and the Bloc Québécois made slight gains. The Green Party failed to win any seats and lost its only Member of Parliament. Following the election, the Liberals and New Democrats  attempted to form a coalition government and topple the Conservatives from power, but were unsuccessful in doing so."
    ],
    "2011": [
        "The 2011 Canadian federal election was held on May 2, 2011, to elect members to the House of Commons of Canada of the 41st Canadian Parliament.",
        "The writs of election for the 2011 election were issued by Governor General David Johnston on March 26. Prime Minister Stephen Harper advised the Governor General to dissolve parliament after the House of Commons passed a motion of non-confidence against the government, finding it to be in contempt of Parliament. A few days before, the three opposition parties had rejected the minority government's proposed budget.",
        "The Conservative Party remained in power, increasing its seat count from a minority to a majority government, marking the first time since 1988 that a right-of-centre party formed a majority government. The Liberal Party, sometimes dubbed the \"natural governing party\", was reduced to third party status for the first time as they won the fewest seats in its history, and party leader Michael Ignatieff was defeated in his riding. The Bloc Québécois lost official party status for the first time since contesting general elections in 1993. Party leader Gilles Duceppe was defeated in his riding and subsequently resigned as leader. The New Democratic Party led by Jack Layton won the largest number of seats in its history, enabling it to form the Official Opposition for the first time in the party's history, as they made a major breakthrough in Quebec. The Green Party elected its first member to the House of Commons with its leader, Elizabeth May, becoming MP for Saanich—Gulf Islands."
    ],
    "2015": [
        "The 2015 Canadian federal election held on October 19, 2015, saw the Liberal Party, led by Justin Trudeau, win 184 seats, allowing it to form a majority government with Trudeau becoming the next prime minister.",
        "The election was held to elect members to the House of Commons of the 42nd Canadian Parliament. In keeping with the maximum four year term under a 2007 amendment to the Canada Elections Act, the writs of election for the 2015 election were issued by Governor General David Johnston on August 4. The ensuing campaign was one of the longest in Canadian history. It was also the first time since the 1979 election that a prime minister attempted to remain in office into a fourth consecutive Parliament and the first time since the 1980 election that someone attempted to win a fourth term of any kind as prime minister.",
        "The Liberal Party, led by Justin Trudeau, won 184 seats, allowing it to form a majority government with Trudeau becoming the next prime minister. Trudeau and the rest of his cabinet were sworn in on November 4, 2015. The Conservative Party, led by incumbent Prime Minister Stephen Harper, won 99 seats, becoming the Official Opposition after nearly a decade on the government benches. The New Democratic Party, led by Tom Mulcair, won 44 seats, becoming the third-largest party in the House of Commons, after having formed the Official Opposition following the 2011 election. The Bloc Québécois won 10 seats, the Green Party won 1 seat, and Strength in Democracy lost all its seats.",
        "The Liberal Party's increase of 148 seats from the previous election was the largest-ever numerical increase by a party in a Canadian election. Prior to the campaign, the Liberals had held only 36 seats—the fewest seats ever held at dissolution by any federal party that won the following election. The Liberals also became the first federal party in Canadian history to win a majority of seats without having been either the governing party or the Official Opposition in the previous parliament, and this was only the second time a party went from having the third-most seats to the most seats (the first being in 1925). It was the second largest number of seats won in a federal election for the Liberals, the best being 191 in 1949. The election also had the highest voter turnout since 1993. Every party represented in the House of Commons except the Liberal Party recorded a decrease in its popular vote share. There was an increase in voter turnout among all age groups. The largest was among eligible voters aged 18 to 24, which increased 18.3 points, to 57.1%. Elections Canada reported that this was the biggest increase in turnout among this age group since it began making demographic turnout estimates.",
        "Following the election, Harper conceded defeat to Trudeau and resigned as leader of the Conservative Party. Gilles Duceppe resigned as leader of the Bloc Québécois shortly after the election on October 22, 2015. Tom Mulcair announced his intention to remain leader of the NDP, but was forced to step down in October 2017, after losing a party vote on his leadership in the spring of 2016."
    ],
    "2019": [
        "The 2019 Canadian federal election was held on October 21, 2019. Members of the House of Commons were elected to the 43rd Canadian Parliament. In keeping with the maximum four-year term under a 2007 amendment to the Canada Elections Act, the writs of election for the 2019 election were issued by Governor General Julie Payette on September 11, 2019.",
        "With 33.12% of the vote for the Liberal Party, led by incumbent Prime Minister Justin Trudeau, the 2019 election set, at the time, a record for the lowest vote share for a party that would go on to form a single-party minority government (this record would later be beaten in the subsequent 2021 federal election). The Liberals lost the popular vote to the Conservative Party by one per cent, marking only the second time in Canadian history that a governing party formed a government while receiving less than 35 per cent of the national popular vote, the first time being the inaugural 1867 Canadian federal election after Confederation. It was also the first time since 1979 that the party with the most votes overall did not win the most seats.",
        "The Conservatives, led by Andrew Scheer, won 121 seats and remained the Official Opposition. The Bloc Québécois, led by Yves-François Blanchet, won 32 seats to regain official party status and became the third party for the first time since 2008. The New Democratic Party, led by Jagmeet Singh, won 24 seats, its worst result since 2004. The Green Party, led by Elizabeth May, saw its best election results with three seats and for the first time received over one million votes. The Greens also elected their first MP outside of British Columbia, Jenica Atwin in Fredericton, New Brunswick. Independent MP Jody Wilson-Raybould won her seat and was the first independent to win a seat in over a decade. In their first election, the People's Party failed to win any seats, as leader Maxime Bernier lost his own seat in Beauce, a seat he won as a Conservative in the previous four elections before forming his own party following his unsuccessful bid for the Conservative Party's leadership."
    ],
    "2021": [
        "The 2021 Canadian federal election was held on September 20, 2021, to elect members of the House of Commons to the 44th Canadian Parliament. The writs of election were issued by Governor General Mary Simon on August 15, 2021, when Prime Minister Justin Trudeau requested the dissolution of parliament for a snap election.",
        "Trudeau won a third term as prime minister, his second minority government. Though the Liberals were hoping to win a majority government in order to govern alone, the results were mostly unchanged from the 2019 Canadian federal election. The Liberals won the most seats at 160; as this fell short of the 170 seats needed for a majority in the House of Commons, they formed a minority government with support from other parties. The 2021 election set a new record for the lowest vote share for a party that would go on to form a single-party minority government. The Liberals won 32.6 per cent of the popular vote, while losing the popular vote to the Conservatives as they did in 2019.",
        "The Conservatives led by Erin O'Toole won 119 seats, two fewer than their result in 2019, and continued as the Official Opposition. The Bloc Québécois led by Yves-François Blanchet won 32 seats, unchanged from the prior election. The New Democratic Party led by Jagmeet Singh won 25 seats, a net increase of one seat, but nonetheless fell short of expectations. The Green Party maintained two seats but party leader Annamie Paul was defeated for the third time in her riding of Toronto Centre. The party received 2.3 per cent of the popular vote, approximately a third of what they won in 2019. The People's Party did not win any seats, despite winning nearly 5 per cent of the popular vote, and party leader Maxime Bernier was defeated for the second time in his riding of Beauce.",
        "Trudeau faced public blowback for holding an election in the middle of a global pandemic due to his expectation that doing so could translate his supposed rallying popularity into a landslide victory. Criticism worsened when Trudeau failed to win by a majority and instead repeated his 2019 election showing. An official government probe later found that China attempted to meddle in the election to influence Canadian foreign policy.",
        "Paul resigned as Green Party leader two months after the election, and O'Toole was ousted as Conservative leader by his party's caucus in February 2022 over the poor showing in the election and other disagreements ongoing at the time. In March 2022, the NDP and Liberals formed a confidence and supply agreement which lasted until the NDP withdrew in September 2024.",
        "The election was the second one in a row where the Liberals succeeded in winning a plurality of seats despite having fewer votes than the Conservative Party."
    ]
}